; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v5 - type_1 ?v6 - type_3)
 	      (pred_1 ?v3 - object ?v6 - type_3)
	      (pred_2 ?v5 - type_1 ?v8 - type_2)
	      (pred_4 ?v5 - type_1 ?v3 - object ?v8 - type_2))

   (:action op_2
       :parameters  (?v5 - type_1 ?v4 ?v2 - type_3)
       :precondition (and  (pred_3 ?v5 ?v4))
       :effect (and  (pred_3 ?v5 ?v2)
		     (not (pred_3 ?v5 ?v4))))

   (:action op_1
       :parameters (?v5 - type_1 ?v1 - object ?v7 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v7) (pred_3 ?v5 ?v7) (pred_2 ?v5 ?v8))
       :effect (and (pred_4 ?v5 ?v1 ?v8)
		    (not (pred_1 ?v1 ?v7)) 
		    (not (pred_2 ?v5 ?v8))))

   (:action op_3
       :parameters (?v5 - type_1 ?v1 - object ?v7 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v1 ?v8) (pred_3 ?v5 ?v7))
       :effect (and (pred_1 ?v1 ?v7)
		    (pred_2 ?v5 ?v8)
		    (not (pred_4 ?v5 ?v1 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_09 obj_08 - type_1
obj_10 obj_07 obj_03 obj_05 - type_2
obj_04 obj_11 obj_06 obj_01 - type_3
obj_02 obj_13 obj_12 - object)
(:init
(pred_3 obj_09 obj_01)
(pred_2 obj_09 obj_10)
(pred_2 obj_09 obj_07)
(pred_3 obj_08 obj_11)
(pred_2 obj_08 obj_03)
(pred_2 obj_08 obj_05)
(pred_1 obj_02 obj_11)
(pred_1 obj_13 obj_06)
(pred_1 obj_12 obj_01)
)
(:goal
(and
(pred_1 obj_02 obj_01)
(pred_1 obj_13 obj_04)
(pred_1 obj_12 obj_06)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_09 obj_01) (pred_3 obj_08 obj_01))))
  )
)
)

; plan
1. (op_1 obj_08 obj_02 obj_11 obj_05)
   deleted: (pred_1 obj_02 obj_11) (pred_2 obj_08 obj_05)
   added: (pred_4 obj_08 obj_02 obj_05)
   goals met: 0 of 3
2. (op_1 obj_09 obj_12 obj_01 obj_07)
   deleted: (pred_1 obj_12 obj_01) (pred_2 obj_09 obj_07)
   added: (pred_4 obj_09 obj_12 obj_07)
   goals met: 0 of 3
3. (op_2 obj_09 obj_01 obj_06)
   deleted: (pred_3 obj_09 obj_01)
   added: (pred_3 obj_09 obj_06)
   goals met: 0 of 3
4. (op_2 obj_08 obj_11 obj_01)
   deleted: (pred_3 obj_08 obj_11)
   added: (pred_3 obj_08 obj_01)
   goals met: 0 of 3
5. (op_3 obj_08 obj_02 obj_01 obj_05)
   deleted: (pred_4 obj_08 obj_02 obj_05)
   added: (pred_1 obj_02 obj_01) (pred_2 obj_08 obj_05)
   goals met: 1 of 3
6. (op_3 obj_09 obj_12 obj_06 obj_07)
   deleted: (pred_4 obj_09 obj_12 obj_07)
   added: (pred_1 obj_12 obj_06) (pred_2 obj_09 obj_07)
   goals met: 2 of 3
7. (op_1 obj_09 obj_13 obj_06 obj_10)
   deleted: (pred_1 obj_13 obj_06) (pred_2 obj_09 obj_10)
   added: (pred_4 obj_09 obj_13 obj_10)
   goals met: 2 of 3
8. (op_2 obj_09 obj_06 obj_04)
   deleted: (pred_3 obj_09 obj_06)
   added: (pred_3 obj_09 obj_04)
   goals met: 2 of 3
9. (op_3 obj_09 obj_13 obj_04 obj_10)
   deleted: (pred_4 obj_09 obj_13 obj_10)
   added: (pred_1 obj_13 obj_04) (pred_2 obj_09 obj_10)
   goals met: 3 of 3
